#!/bin/bash
# --------------------------------------------------------------------------------------------------
# システム名    ：構成管理サーバーSCMS
# サブシステム名：04SYSOP
# ファイル名    ：UtyDirDelete.sh
#
# 概要説明      ：SCMS初期構築時のシェルスクリプト
# --------------------------------------------------------------------------------------------------
# 変更履歴：
# 改定                         変更理由                                               担当者
# 番号  変更日     バージョン  案件/問題   変更内容                                   氏名
# --------------------------------------------------------------------------------------------------
# 001   2015-04-03 ver.1.0.0   201412-011  初版                                       橋本 英雄
# --------------------------------------------------------------------------------------------------
DIRECTORY=$1
RANGE=$2
TODAY=`date "+%Y%m%d"`
MKDIRNAME=""
# --------------------------------------------------------------------------------------------------
# usage
# 機能    : 処理説明
# 引数    : 
# --------------------------------------------------------------------------------------------------
usage() {
cat <<EOF

$(basename ${0})
     指定ディレクトリ内のファイル一覧で削除期間を超えた年月日文字ファイルを日付けディレクトリに移動します
	 日付けフォルダが無ければ作成します
	 日付けフォルダと同じ名前のファイルがあればリネームします
	 日付けの判定は
	 1)先頭 8桁 yyyymmdd_FILE.NAME
	 2)先頭14桁 yyyymmddHHMMSS_FILE.NAME
	 3)末尾 8桁 FILE.NAME.yyyymmdd
	 4)末尾14桁 FILE.NAME.yyyymmddHHMMSS
	 に一致した文字列で判定します
Usage:
     $(basename ${0}) [DIRECTORY] [RANGE]
	 DIRECTORY    コピー先ディレクトリを指定します
	 RANGE        削除期間（日数）
EOF
}
# --------------------------------------------------------------------------------------------------
# FindFiles
# 機能    : ディレクトリ内から一覧取得する
# 引数    : Arg1 - 
# --------------------------------------------------------------------------------------------------
FindDirectory() {
	#
	DELSTR=$1
	FILES="${DIRECTORY}/*"
	FILARRAY=()
	DIRARRAY=()

	for filepath in $FILES; do
		if [  -f $filepath ]; then
			FILARRAY+=("$filepath")
		fi
		if [  -d $filepath ]; then
			DIRARRAY+=("$filepath")
		fi
	done
	#
	for i in ${DIRARRAY[@]}; do
		DIRNAME=$i
		#echo ${DIRNAME} ${DELSTR}
		Chcek1 ${DIRNAME} ${DELSTR}
		result=$?
		if [ ! $result == 0 ]; then
			echo "MoveDir [$result]: $i  ⇒ ${DIRNAME}"
		
			DeleteDirectory $i
		fi
	done
}
# --------------------------------------------------------------------------------------------------
# 
# 機能    : ファイル名先頭が yyyymmddHHMMSSから始まる場合
# 引数    : 
# --------------------------------------------------------------------------------------------------
Chcek1() {
	#
	FILE=`basename $1`
	DELSTR=$2

	STR=`echo ${FILE} | sed -e "s/^\([0-9]\{4\}[0-9]\{2\}[0-9]\{2\}\)[0-9]\{6\}$/\1/"`

	if [ ! "${STR:0:8}" ">" "${DELSTR}" ]; then
		MKDIRNAME="${STR:0:8}"
		return 1
	fi
	return 0;
}
# --------------------------------------------------------------------------------------------------
# DeleteDirectory
# 機能    : ディレクトリの削除
# 引数    : Arg1 - 削除ディレクトリ名
# --------------------------------------------------------------------------------------------------
DeleteDirectory() {
	DIR=$1
	#
	if [ ! -d ${DIR} ]; then
		echo "Directory Delete,Not Found ${DIR}"
		exit 2
	else
		# ディレクトリ削除
		rm -r -f ${DIR}
	fi
}
# --------------------------------------------------------------------------------------------------
# 主処理
# --------------------------------------------------------------------------------------------------
# 引数チェック
case $1 in
	"")
			usage
			exit 8
			;;
	*)
		;;
esac
case $2 in
	"")
			usage
			exit 8
			;;
	*)
		;;
esac

# 指定フォルダが正しいフォルダか
if [ ! -d ${DIRECTORY}  ]; then
	echo "Is Not Directory ! ${DIRECTORY}"
	exit 8
fi
# 指定フォルダ名が/で終っているか
if [ ${DIRECTORY: -1} == "/" ]; then
	DIRECTORY=${DIRECTORY/%?/}
fi

DELDATA=`date -d ${RANGE}day "+%Y%m%d"`

echo "Dir       : ${DIRECTORY}"
echo "削除期間  : ${RANGE}"
echo "削除日    : ${DELDATA}"

# 処理部
FindDirectory ${DELDATA}

# 終処理部
exit 0
