#!/bin/bash
# --------------------------------------------------------------------------------------------------
# システム名    ：構成管理サーバーSCMS
# サブシステム名：
# ファイル名    ：UtyFileBackup.sh
#
# 概要説明      ：年月日時刻文字を付けたものに変更します
# --------------------------------------------------------------------------------------------------
# 変更履歴：
# 改定                         変更理由                                               担当者
# 番号  変更日     バージョン  案件/問題   変更内容                                   氏名
# --------------------------------------------------------------------------------------------------
# 001   2015-04-03 ver.1.0.0   201412-011  初版                                       橋本 英雄
# --------------------------------------------------------------------------------------------------
ARGFILE=$1
DIRECTORY=$2
TODAY=`date "+%Y%m%d%H%M%S"`
# --------------------------------------------------------------------------------------------------
# usage
# 機能    : 処理説明
# 引数    : 
# --------------------------------------------------------------------------------------------------
usage() {
cat <<EOF

$(basename ${0})
     指定ファイルを年月日時刻文字を付けたものに変更します
Usage:
     $(basename ${0}) [FILE] [DIRECTORY]
	 FILE         対象ファイルをフルパスで指定します
	 DIRECTORY    コピー先ディレクトリを指定します
EOF
}
# --------------------------------------------------------------------------------------------------
# CopyFile
# 機能    : ファイルのコピー
# 引数    : Arg1 - コピー元ファイル名
#         : Arg2 - コピー先ファイル名
# --------------------------------------------------------------------------------------------------
CopyFile() {
	#
	FILE=$1
	sCopyFile=$2
	# コピー元ファイルの確認
	if [ ! -f ${FILE} ]; then
		echo "File Copy,Not Found ${FILE}"
		exit 1
	else
		# ファイルコピー
		cp ${FILE} ${sCopyFile}
	fi
}
# --------------------------------------------------------------------------------------------------
# DeleteFile
# 機能    : ファイルの削除
# 引数    : Arg1 - 削除ファイル名
# --------------------------------------------------------------------------------------------------
DeleteFile() {
	#
	FILE=$1
	if [ ! -f ${FILE} ]; then
		echo "File Delete,Not Found ${FILE}"
		exit 2
	else
		# ファイル削除
		rm ${FILE}
	fi
}
# --------------------------------------------------------------------------------------------------
# 主処理
# --------------------------------------------------------------------------------------------------

# 引数チェック
case $1 in
	"")
			usage
			exit 8
			;;
	*)
		;;
esac
case $2 in
	"")
			usage
			exit 8
			;;
	*)
		;;
esac

# 指定フォルダが正しいフォルダか
if [ ! -d ${DIRECTORY}  ]; then
	echo "Is Not Directory ! ${DIRECTORY}"
	exit 8
fi

# 指定フォルダ名が/で終っているか
if [ ${DIRECTORY: -1} == "/" ]; then
	DIRECTORY=${DIRECTORY/%?/}
fi

echo "Original : ${ARGFILE}"
echo "CopyDir  : ${DIRECTORY}"

# 処理部
CopyFile ${ARGFILE} ${DIRECTORY}/${TODAY}_`basename ${ARGFILE}`
DeleteFile ${ARGFILE}

# 終処理部
exit 0
